AccumulationRegisters/ТоварыВРезервеВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеВПути/Ext/ManagerModule.bsl
// Получение остатков по резервам
Функция ПолучитьОстаткиПоРезервам(Дата, СписокПозиций, Организация) Экспорт
	
	//++ №13982 на случай, когда резервы списываются по заказу покупателя, сделаем заглушку
	Если СписокПозиций.Колонки.Найти("ЗаказДоговор") = Неопределено Тогда
		СписокПозиций.Колонки.Добавить("ЗаказДоговор", новый ОписаниеТипов("ДокументСсылка.ЗаказДоговор"));
	КонецЕсли;
	//-- №13982
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.Заказ КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	Позиции.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Позиции			
	|ИЗ
	|	&СписокТоваров КАК Позиции
	|;	
	|//////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Позиции.Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.ДокументРезерва КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(Позиции.Количество, 0) КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ТоварыВРезервеВпутиОстатки.КоличествоОстаток, 0) КАК КоличествоВРезерве,
	//++ №13982
	|	ЕСТЬNULL(ТоварыВРезервеВпутиОстаткиПоДоговору.КоличествоОстаток, 0) КАК КоличествоВРезервеПоДоговору
	//-- №13982
	|ИЗ
	|	ВТ_Позиции КАК Позиции
	|
	// №11431|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеВпути.Остатки(&ТекДата) КАК ТоварыВРезервеВпутиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеВпути.Остатки() КАК ТоварыВРезервеВпутиОстатки
	|		ПО Позиции.Организация = ТоварыВРезервеВпутиОстатки.Организация
	|			И Позиции.Склад = ТоварыВРезервеВпутиОстатки.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеВпутиОстатки.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеВпутиОстатки.ХарактеристикаНоменклатуры
	|			И Позиции.ДокументРезерва = ТоварыВРезервеВпутиОстатки.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеВпутиОстатки.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеВпутиОстатки.ВидТабличнойЧасти
	|		
	//++ №13982
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеВпути.Остатки() КАК ТоварыВРезервеВпутиОстаткиПоДоговору
	|		ПО Позиции.Организация = ТоварыВРезервеВпутиОстаткиПоДоговору.Организация
	|			И Позиции.Склад = ТоварыВРезервеВпутиОстаткиПоДоговору.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеВпутиОстаткиПоДоговору.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеВпутиОстаткиПоДоговору.ХарактеристикаНоменклатуры
	|			И Позиции.ЗаказДоговор = ТоварыВРезервеВпутиОстаткиПоДоговору.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеВпутиОстаткиПоДоговору.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеВпутиОстаткиПоДоговору.ВидТабличнойЧасти
	//-- №13982
	|
	|ГДЕ
	|	ЕСТЬNULL(ТоварыВРезервеВпутиОстатки.КоличествоОстаток, 0) > 0
	//++ №13982
	|	Или ЕСТЬNULL(ТоварыВРезервеВпутиОстаткиПоДоговору.КоличествоОстаток, 0) > 0
	//-- №13982
	|
	|";
	// №11431 комментируем т.к. остатки резервов берем на текущую дату Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("СписокТоваров", СписокПозиций);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получить товары в резерве по списку номенклатуры табличной части, складу и документу-основанию
Функция КонтрольРезерва (Знач ДокументРезерва, Знач Организация, Знач Склад, Знач ДатаКонтроля, Знач ТЧДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	Товары.Количество КАК Количество,
		|	Товары.Коэффициент КАК Коэффициент
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТоварыВРезервеВпутиОстатки.КоличествоОстаток, 0) КАК КоличествоРезерве,
		|	ТоварыВРезервеВпутиОстатки.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ТоварыВРезервеВпутиОстатки.Склад КАК Склад,
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВТТовары.Количество КАК Количество,
		|	ВТТовары.Коэффициент КАК Коэффициент
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеВпути.Остатки(
		|				&Дата,
		|				Склад = &Склад И Организация = &Организация	И ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеВпутиОстатки
		|		ПО ВТТовары.Номенклатура = ТоварыВРезервеВпутиОстатки.Номенклатура
		|			И ВТТовары.ХарактеристикаНоменклатуры = ТоварыВРезервеВпутиОстатки.ХарактеристикаНоменклатуры 
		|			И ВТТовары.СерияНоменклатуры = ТоварыВРезервеВпутиОстатки.СерияНоменклатуры";
	
	Если Склад = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад = &Склад И ", "");
	КонецЕсли;	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация И ", "");
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", ДатаКонтроля);
	Запрос.УстановитьПараметр("ДокументРезерва", ДокументРезерва);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товары", ТЧДокумента.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
КонецФункции
